%
% 参数选择
% 稀疏系数beta的选择，AC图1
% 稀疏系数beta的选择，MI图2
%

clc
clear all
close all
% 预处理完成

% AC准确率
beta=[0:0.1:1];

% Yale_32数据集
AC_beta_2_Yale=[1 1 1 1 1 0.87 0.8567 0.8402 0.8337 0.8058 0.8];
AC_beta_3_Yale=[1 1 1 1 0.8932 0.8761 0.85 0.7434 0.7268 0.703 0.7];
AC_beta_4_Yale=[0.982 1 1 0.8824 0.7683 0.7600 0.7429 0.7268 0.714 0.707 0.68];
AC_beta_5_Yale=[0.841 0.9573 0.9019 0.8664 0.8474 0.7392 0.7201 0.7184 0.6901 0.6814 0.67];
AC_beta_6_Yale=[0.82 0.933 0.9063 0.8209 0.772 0.6926 0.6729 0.6492 0.63037 0.6248 0.6];
AC_beta_7_Yale=[0.818 0.9039 0.9047 0.8037 0.7802 0.726 0.6492 0.63 0.6172 0.6084 0.6];
AC_beta_8_Yale=[0.827 0.90062 0.8819 0.7604 0.6813 0.6472 0.6359 0.609 0.5941 0.5702 0.57];
AC_beta_9_Yale=[0.816 0.8975 0.8597 0.78 0.6524 0.6301 0.601 0.5829 0.562 0.5419 0.5];
AC_beta_10_Yale=[0.8116 0.8800 0.824 0.747 0.641 0.63 0.6026 0.572 0.552 0.526 0.49];

% AC_lamda_Yale=[80.26 81.62 82.17 82.34 82.56 82.40 80.85 80.45 78.00];

figure(1)
plot(beta,AC_beta_2_Yale,'-+m',beta,AC_beta_3_Yale,'-.o r',beta,AC_beta_4_Yale,'--*g',beta,AC_beta_5_Yale,'-xb',...
    beta,AC_beta_6_Yale,'- diamond k',beta,AC_beta_7_Yale,'-.^ m',beta,AC_beta_8_Yale,'-- square r',...
    beta,AC_beta_9_Yale,'- pentagram k',beta,AC_beta_10_Yale,'-+b');
xlabel('beta');
ylabel('准确率（%）')
legend('K=2','K=3','K=4','K=5','K=6','K=7','K=8','K=9','K=10');
title('Yale');

 axis([0 1 0.45 1]);
 set(gca,'position',[0.1 0.1 .845 .845]);
%%
% PIE数据集
AC_beta_2_PIE=[1 1 1 0.974 0.9726 0.9573 0.9567 0.9002 0.8737 0.8658 0.8333];
AC_beta_3_PIE=[1 1 1 0.94 0.9132 0.8861 0.863 0.8434 0.8268 0.803 0.77];
AC_beta_4_PIE=[0.882 1 1 0.7824 0.6683 0.651 0.6229 0.6068 0.574 0.56 0.55];
AC_beta_5_PIE=[0.831 0.9873 0.8919 0.7864 0.7374 0.6692 0.601 0.584 0.5901 0.544 0.53];
AC_beta_6_PIE=[0.84 0.9333 0.883 0.8509 0.7872 0.6726 0.6329 0.5992 0.5837 0.5548 0.52];
AC_beta_7_PIE=[0.868 0.925 0.8627 0.7837 0.702 0.672 0.6392 0.58 0.5772 0.5484 0.50];
AC_beta_8_PIE=[0.842 0.9076 0.8321 0.81 0.752 0.725 0.6859 0.649 0.54 0.532 0.4508];
AC_beta_9_PIE=[0.835 0.893 0.8097 0.7826 0.74024 0.728 0.651 0.56 0.532 0.5109 0.484];
AC_beta_10_PIE=[0.828 0.88117 0.8302 0.793 0.7397 0.702 0.623 0.583 0.5742 0.503 0.45];


figure(2)
plot(beta,AC_beta_2_PIE,'-+m',beta,AC_beta_3_PIE,'-.o r',beta,AC_beta_4_PIE,'--*g',beta,AC_beta_5_PIE,'-xb',...
    beta,AC_beta_6_PIE,'- diamond k',beta,AC_beta_7_PIE,'-.^ m',beta,AC_beta_8_PIE,'-- square r',...
    beta,AC_beta_9_PIE,'- pentagram k',beta,AC_beta_10_PIE,'-+b');
xlabel('beta');
ylabel('准确率（%）')
legend('K=2','K=3','K=4','K=5','K=6','K=7','K=8','K=9','K=10');
title('PIE');

 axis([0 1 0.45 1]);
  set(gca,'position',[0.1 0.1 .845 .845]);
  
%%
% COIL数据集
AC_beta_2_COIL=[1 1 1 0.9634 0.943 0.9367 0.90 0.8792 0.8437 0.8358 0.8333];
AC_beta_3_COIL=[0.967 1 1 0.937 0.9172 0.8761 0.8453 0.8234 0.8268 0.828 0.830];
AC_beta_4_COIL=[0.902 1 0.973 0.9124 0.8683 0.815 0.778 0.738 0.742 0.738 0.7292];
AC_beta_5_COIL=[0.851 0.9473 0.9019 0.7764 0.7074 0.6692 0.5921 0.5584 0.5431 0.5314 0.51];
AC_beta_6_COIL=[0.829 0.9053 0.89463 0.8409 0.763 0.726 0.653 0.624 0.5837 0.548 0.5];
AC_beta_7_COIL=[0.871 0.904 0.8572 0.8037 0.754 0.727 0.6492 0.58 0.572 0.5384 0.485];
AC_beta_8_COIL=[0.846 0.88 0.842 0.7717 0.734 0.7072 0.6459 0.566 0.541 0.542 0.46];
AC_beta_9_COIL=[0.813 0.8701 0.85 0.76 0.724 0.6431 0.62 0.571 0.5402 0.48 0.44];
AC_beta_10_COIL=[0.783 0.88 0.84 0.874 0.76 0.66 0.62 0.54 0.51 0.49 0.40];

figure(3)
plot(beta,AC_beta_2_COIL,'-+m',beta,AC_beta_3_COIL,'-.o r',beta,AC_beta_4_COIL,'--*g',beta,AC_beta_5_COIL,'-xb',...
    beta,AC_beta_6_COIL,'- diamond k',beta,AC_beta_7_COIL,'-.^ m',beta,AC_beta_8_COIL,...
    '-- square r',beta,AC_beta_9_COIL,'- pentagram k',beta,AC_beta_10_COIL,'-+b');
xlabel('beta');
ylabel('准确率（%）')
legend('K=2','K=3','K=4','K=5','K=6','K=7','K=8','K=9','K=10');
title('COIL');

 axis([0 1 0.45 1]);
  set(gca,'position',[0.1 0.1 .845 .845]);
  
%%

